<template>
<div class="container home-page bg-black text-opacity-25">
  <h1>Тестовые задания на Vue</h1>

  <h2 class="text-white"><u>Todo</u></h2>
  <div class="text-start">
    <h3>Задача</h3>
      <p>Создать одностраничное TODO-приложение с использованием Vue.js,
         с возможностью ведения/импорта/экспорта проектов.</p>
    <ul>
      <li>
        <h4>Easy</h4>
        <ul>
          <li>
            Каждая новая вкладка в бразуере с приложением - отдельный проект со своим списком задач;
          </li>
          <li>
            Система переключения проектов в пределах одной вкладки считается нарушением этого требования!
          </li>
          <li>
            Редактируемое название проекта в качестве заголовка страницы;
          </li>
        </ul>
        <h5>Список с задачами:</h5>
        <ul>
          <li>
            Добавление новой задачи в список;
          </li>
          <li>
            Удаление любой задачи из списка;
          </li>
          <li>
            Возможность пометить любую задачу сделанной и возможность убрать эту пометку (mark as done/not done);
          </li>
          <li>
            Вся информация (название проекта, список задач, состояние задач) должна сохраняться при перезагрузке страницы;
          </li>
        </ul>
        <h5>Опционально:</h5>
        <ul>
          <li>
            Возможность добавлять подзадачи в любую задачу (с потенциально бесконечной глубиной);
          </li>
          <li>
            Поле ввода для поиска/фильтрации задач в списке (фильтр должен сохраняться после перезагрузки страницы);
          </li>
          <li>
            Возможность редактирования названия задачи после её создания;
          </li>
        </ul>
      </li>
      <hr>
      <li>
        <h4>Medium</h4>
        <p>Все требования easy, включая опциональные. А также:</p>
        <ul>
          <li>
            Возможность перемещать любые задачи (со всем списком подзадач) из любого открытого проекта в любой другой открытый проект;
          </li>
          <li>
            Нельзя использовать LocalStorage, Cookies, IndexedDB и WebSQL хранилища;
          </li>
          <li>
            Если ваше приложение пишет хоть что-нибудь в одно из этих хранилищ - требование считается невыполненным!
            Это касается и библиотек, которые используют эти типы хранилищ: например - vuex-multi-tab-state.
          </li>
          <li>
            Экспорт проекта в файл / импорт проекта из файла;
          </li>
          <li>
            Имя сохраняемого файла должно соответствовать названию проекта.
          </li>
          <li>
            Drag-n-drop для перемещения задач в списке;
          </li>
          <li>
            Сохранение текущего фильтра для возможности его быстрого применения потом;
          </li>
          <li>
            Итоговое приложение должно весить не более 200 KB (сумма всех загружаемых файлов, исключая картинки);
          </li>
        </ul>
        <h5>Опционально:</h5>
        <ul>
          <li>
            Наличие CSS-анимаций для drag-n-drop и фильтрации задач;
          </li>
          <li>
            Использовать TypeScript для 100% кодовой базы (исключая вёрстку и стили);
          </li>
          <li>
            Использовать Vue Composition API или vue@next;
          </li>
          <li>
            Использовать ESLint/TSLint для контроля качества кода (приветствуется использование настройки KazanExpress/TSLint);
          </li>
          <li>
            Использовать сборщик/бандлер (например, webpack) для сборки приложения в SPA;
          </li>
        </ul>
      </li>
      <hr>
      <li>
        <h4>Hard</h4>
        <p>Все требования medium, включая опциональные, а также:</p>
        <ul>
          <li>
            Итоговое приложение должно весить не более 100 KB (сумма всех загружаемых файлов, исключая картинки);
          </li>
          <li>
            Drag-n-drop с поддержкой тач-скрина;
          </li>
          <li>
            Масштабируемость на мобильные устройства до 320*480px (iPhone 4);
          </li>
          <li>
            Возможность быстрого просмотра и редактирования описания у любой задачи;
          </li>

        </ul>
        <h5>Опционально:</h5>
        <ul>
          <li>
            SSR;
          </li>
          <li>
            PWA;
          </li>
          <li>
            Опция фильтрации задач по RegExp;
          </li>
          <li>
            Возможность добавлять/удалять именованные списки для задач, между которыми их можно перетаскивать (как в trello);
          </li>
      </ul>
    </li>
      <hr>
      <li>
        <h4>Insane</h4>
        <p>Все требования hard, включая опциональные, а также:</p>
        <ul>
          <li>
            Нельзя использовать Vue.js или любые другие фреймворки/библиотеки для клиентской части - только нативный JavaScript/TypeScript;
            В том числе:
            Для реактивности/биндинга данных;
            Для внесения изменений в DOM;
            Для бизнес-логики;
            Да, jQuery/React/Lodash/Underscore/Bootstrap тоже нельзя!
          </li>
          <li>
            Документация на JSDoc, по всем стандартам;
          </li>
          <li>
            Итоговое приложение должно весить не более 50 KB (сумма всех загружаемых файлов, исключая картинки);
          </li>
          <li>
            Итоговый скомпилированный проект должен работать на нативных ES6-модулях с помощью script type="module"
          </li>
          <li>
            Наличие Source-Maps для итогового приложения и инструкции по их включению;
          </li>
          <li>
            Полный набор горячих клавиш для каждого действия в приложении - создание/удаление/редактирование тасок/проектов, экспорт/импорт и прочее;
            (Обязательна инструкция со списком всех горячих клавиш.)
          </li>
          <li>
            Оценка качества кода "A" на Code Climate;
          </li>

        </ul>
        <h5>Опционально:</h5>
        <ul>
          <li>
            Использовать Conventional Commitlint;
          </li>
          <li>
            Использовать CustomElements/WebComponents и Shadow DOM;
          </li>
          <li>
            100% test coverage с использованием Jest/Mocha и Coveralls/Code Climate;
          </li>
          <li>
            Использовать travis.ci, now.sh, GitHub Pages или GitHub Actions для CI/CD;
          </li>
          <li>
            Использовать Service-Worker для уведомления пользователя о новых версиях;
          </li>
          <li>
            Взаимоисключающие пункты:
            SSR без использования сторонних библиотек;
            Отсутствие SSR и отсутствие бандлера (webpack, rollup, etc.), node_modules и прочего - т.е. нельзя использовать никакие библиотеки (кроме TypeScript) для обработки кода;
          </li>
        </ul>
      </li>
    </ul>
    <a href="https://github.com/KazanExpress/frontend-test-task">Подробнее и доп.ссылки</a>
  </div>

  <h2 class="text-white"><u>Map</u></h2>
  <div class="text-start">
    <h3>Задача</h3>
    <p>Реализовать приложение, в котором отображается карта с нанесенными на нее маркерами объектов из представленного ниже списка. По нажатию на объект из списка он становится выбранным (появляется какой-то отличительный признак, например, подсветка его строки), вместе с этим карта изменяет масштаб до 10 уровня и центрируется на этом маркере.
      Данные объектов доступны прямо в репозитории по <a href="https://raw.githubusercontent.com/waliot/test-tasks/master/assets/data/frontend-1-dataset.json">ссылке</a>.
    </p>

    <h3>Требования</h3>
    <ul>
      <li>TypeScript / JavaScript</li>
      <li>Использование Leaflet</li>
    </ul>

    <h3>Дополнительно (будет преимуществом)</h3>
    <ul>
      <li>Использование современного фреймворка: Angular / React / Vue</li>
      <li>Реализация строки поиска (фильтрация списка с помощью поисковой фразы)</li>
    </ul>

    <a href="https://github.com/waliot/test-tasks/blob/master/tasks/frontend-1.md">Подробнее и доп.ссылки</a>
    </div>
</div>
</template>

<script>
export default {
  name: "AppHome"
}
</script>

<style scoped>

</style>
